# dotfiles/Brewfile

# Taps
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# 중요! 이 줄이 없으면, ~/Applications에 설치하므로 꼭 넣어야 한다.
cask_args appdir: '/Applications'

# Binaries/Libraries
brew "antigen"
brew "cask"
brew "fasd"
brew "fzf"
brew "git"
brew "gradle"
brew "htop"
brew "iproute2mac"
brew "jenv"
brew "maven"
brew "mackup"
brew "neovim"
brew "node"
brew "tomcat"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"
#...

# Applications
cask "java"
cask "alfred"
cask "appcleaner"
cask "duet"
cask "eclipse-jee"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kdiff3"
cask "keka"
cask "ngrok"
cask "pencil"
cask "skype"
cask "sourcetree"
cask "telegram"
cask "virtualbox"
cask "visual-studio-code"
cask "whatsapp"
#...

# The others install software
# Docker
# Final Cut Pro Trial
# KakaoTalk
# Magnet
# NTFS for Mac
# Parallels Desktop
# Steam
# Slack
# Unicorn Blocker
# VPN Unlimited
